Revit 2024 API
ParameterFilterElement.GetCategories Method
 Gets the categories admitted by this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ICollection<ElementId> GetCategories()
Visual Basic
Public Function GetCategories As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetCategories()
See Also
ParameterFilterElement Class
Autodesk.Revit.DB Namespace